public/RouteOSPF.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <header xmlns="xmlapi_1.0">
         <security>
            <user>C14593</user>
            <password hashed="false">Claro348!</password>
         </security>
         <requestID>aquiroga:0001</requestID>
      </header>
   </SOAP:Header>

  <SOAP:Body>
    <find xmlns="xmlapi_1.0">
      <fullClassName>rtr.RouteStats</fullClassName>
        <filter>
          <and>
            <wildcard name="monitoredObjectPointer" value="%router%"/>
            <notEqual name="ospfActiveRoutes" value="0"/>
          </and>
         </filter>
     <resultFilter>
        <attribute>monitoredObjectSiteName</attribute>
        <attribute>monitoredObjectPointer</attribute>
        <attribute>ospfActiveRoutes</attribute>
        <children/>
     </resultFilter>
    </find>
  </SOAP:Body>

</SOAP:Envelope>